In [16]:
import pandas as pd

var = pd.DataFrame({"Name":["siddhant","siddhant","sunil","anil","amar"],
                     "Number":[11,12,13,11,15]})

var1 = var.groupby("Name")

# Here we created two databases  name and number and we sorted the name by using the group function

for x,y in var1:
    print(x)
    print()
    print(y)

amar

   Name  Number
4  amar      15
anil

   Name  Number
3  anil      11
siddhant

       Name  Number
0  siddhant      11
1  siddhant      12
sunil

    Name  Number
2  sunil      13

In [17]:
var1.get_group("siddhant")

# Here we only get the data of siddhant and nothing else

       Name  Number
0  siddhant      11
1  siddhant      12

In [22]:
var1.min()
# returns the min element in the dataset

          Number
Name
amar          15
anil          11
siddhant      11
sunil         13

In [21]:
var1.max()
# returns the max element in the dataset

          Number
Name
amar          15
anil          11
siddhant      12
sunil         13

In [23]:
var1.mean()
# Here we get the mean of all elements

          Number
Name
amar        15.0
anil        11.0
siddhant    11.5
sunil       13.0

In [25]:
var4 = list(var1)
var4

# Here we converted the dataframe into list and stored into a variable

[('amar',
     Name  Number
  4  amar      15),
 ('anil',
     Name  Number
  3  anil      11),
 ('siddhant',
         Name  Number
  0  siddhant      11
  1  siddhant      12),
 ('sunil',
      Name  Number
  2  sunil      13)]